{"id": 1133, "question": "Shivam is working on electric circuits. He requires some connecting wires. He needs to make a total of N connections and he has mentioned his wire length requirements for each connection in an integer sequence A. For buying wires, he need to decide the length of each wire piece, and he’ll get as many wire pieces of the chosen length each at unit cost (cost 1 per piece) but he can't get wires of different lengths. Also, he can't cut wire pieces to make new pieces of different (smaller) length(s).\nBut he can connect any number of wires together to form a new single wire piece whose length is the sum of lengths of the wires connected. So, Shivam needs to choose an integer length for buying wires. Shivam hates to waste anything, and he hates it even more if that thing is money.\nShivam is weak in mathematics and is asking you to help him in this situation. Help him decide the length of wires and total number of wires so as to minimize the total expenditure.\nNote: You cannot make a connection which requires a wire piece of length X with a wire piece of length Y if X≠Y.\nInput:\n·        The first line of the input contains T = Number of Test cases\n·        The first line of each test case contains an integer N\n·        The second line contains N space separated integers A1, A2, …., AN.\nOutput:\nFor each test case print a single line containing two space separated integers, length of each wire and the corresponding minimum cost.\nConstraints:\n·       1 <= T <= 10\n·       1 <= N <= 10^5\n·        1 <= Ai <= 10^5, for each valid i\nSample Input:\n1\n3\n2 4 8\nSample Output:\n2 7", "input_output": [{"input": ["1", "3", "2 4 8"], "output": ["2 7"]}]}
{"id": 704, "question": "Eugene has to do his homework. But today, he is feeling very lazy and wants to you do his homework. His homework has the following given maths problem.\nYou are given three integers: A, N, M. You write the number A appended to itself N times in a row. Let's call the resulting big number X. For example, if A = 120, N = 3, then X will be 120120120. Find out the value of X modulo M.\n\n-----Input-----\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follow.\nEach test case is described in one line containing three integers: A, N and M as described in the problem statement.\n\n-----Output-----\nFor each test case, output a single line containing an integer denoting the value of X modulo M.\n\n-----Constraints-----\n- 1 ≤ T ≤ 105\n- 0 ≤ A ≤ 109\n- 1 ≤ N ≤ 1012\n- 2 ≤ M ≤ 109\n\n-----Subtasks-----\nSubtask #1 (15 points):\n- 0 ≤ A ≤ 100\n- 1 ≤ N ≤ 105\n\nSubtask #2 (25 points):\n- 1 ≤ N ≤ 109\n\nSubtask #3 (60 points):\n- Original constraints\n\n-----Example-----\nInput:\n2\n12 2 17\n523 3 11\n\nOutput:\n5\n6\n\n-----Explanation-----\nExample 1: As A = 12, N = 2, X = 1212, 1212 modulo 17 = 5\nExample 2. As A = 523, N = 3, X = 523523523, 523523523 modulo 11 = 6", "input_output": [{"input": ["2", "12 2 17", "523 3 11", "", ""], "output": ["5", "6"]}]}
{"id": 1518, "question": "The chef was busy in solving algebra, he found some interesting results, that there are many numbers which can be formed by sum of some numbers which are prime. Chef wrote those numbers in dairy. Cheffina came and saw what the chef was doing. Cheffina immediately closed chef's dairy and for testing chef's memory, she starts asking numbers and chef needs to answer wheater given number N can be formed by the sum of K prime numbers if it yes then print 1 else print 0. \n\n-----Input:-----\n- First-line will contain $T$, the number of test cases. Then the test cases follow. \n- Each test case contains a single line of input, two integers $N, K$.\n\n-----Output:-----\nFor each test case, output in a single line answer as 1 or 0.\n\n-----Constraints-----\n- $1 \\leq T \\leq 10^5$\n- $2 \\leq N \\leq 10^5$\n- $1 \\leq K \\leq 10^5$\n\n-----Sample Input:-----\n2\n12 2\n11 2\n\n-----Sample Output:-----\n1\n0", "input_output": [{"input": ["2", "12 2", "11 2"], "output": ["1", "0"]}]}
{"id": 764, "question": "Chef has just found a recipe book, where every dish consists of exactly four ingredients.\nHe is going to choose some two dishes and prepare them for dinner.\nOf course, he likes diversity and wants to know whether the two dishes are similar.\nTwo dishes are called similar if at least half of their ingredients are the same.\nIn other words, at least two of four ingredients of the first dish should also be present in the second dish.\nThe order of ingredients doesn't matter.\nYour task is to examine T pairs of dishes.\nFor each pair, check if the two dishes are similar and print \"similar\" or \"dissimilar\" accordingly.\n\n-----Input-----\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each test case contains four distinct strings, denoting ingredients needed for the first dish.\nEach ingredient is represented by a string of length between 2 and 10 inclusive, consisting of lowercase English letters.\n\nThe second line of each test case describes the second dish in the same format.\n\n-----Output-----\nFor each test case, output a single line containing the answer — \"similar\" if at least half of the ingredients are same, and \"dissimilar\" otherwise (without the quotes).\n\n-----Constraints-----\n- 1 ≤ T ≤ 200\n- The length of each string will be between 2 and 10 inclusive.\n\n-----Example-----\nInput:\n5\neggs sugar flour salt\nsugar eggs milk flour\naa ab ac ad\nac ad ae af\ncookies sugar grass lemon\nlemon meat chili wood\none two three four\none two three four\ngibberish jibberish lalalalala popopopopo\njibberisz gibberisz popopopopu lalalalalu\n\nOutput:\nsimilar\nsimilar\ndissimilar\nsimilar\ndissimilar\n\n-----Explanation-----\nTest case 1. The first dish consists of ingredients: eggs, sugar, flour, salt, while the second dish consists of: sugar, eggs, milk, flour. Three of four ingredients are present in both dishes (eggs, sugar, flour) so the two dishes are similar.\nTest case 2. This example shows that strings in the input don't necessarily represent real food.\nThe answer is again \"similar\", because two ingredients are present in both dishes (\"ac\" and \"ad\").\nTest case 3. The only common ingredient is lemon, so the answer is \"dissimilar\".\nRemember that at least two ingredients should be present in both dishes.", "input_output": [{"input": ["5", "eggs sugar flour salt", "sugar eggs milk flour", "aa ab ac ad", "ac ad ae af", "cookies sugar grass lemon", "lemon meat chili wood", "one two three four", "one two three four", "gibberish jibberish lalalalala popopopopo", "jibberisz gibberisz popopopopu lalalalalu"], "output": ["similar", "similar", "dissimilar", "similar", "dissimilar"]}]}
{"id": 1042, "question": "Chef wants to gift pairs to his friends this new year. But his friends like good pairs\nonly.\nA pair (a , b) is called a good pair if 1 <= a < b <= N such that GCD(a*b , P) = 1.\nSince Chef is busy in preparation for the party, he wants your help to find all the\ngood pairs.\n—————————————————————————————————————\nINPUT\n• The first line of the input contains a single integer T.\n• The first and only line of each test case contain two integer N,P.\n————————————————————————————————————————\nOUTPUT\nFor each test case, print a single line containing one integer — the total number of good\npairs\n————————————————————————————————————————\nCONSTRAINTS\n• 1 ≤ T≤ 50\n• 2 ≤ N,P ≤10^5\n—————————————————————————————————————\nExample Input\n2\n2 3\n3 3\n————————————————————————————————————————\nExample Output\n1\n1", "input_output": [{"input": ["2", "2 3", "3 3", "————————————————————————————————————————"], "output": ["1", "1"]}]}
{"id": 1303, "question": "After the death of their mother, Alphonse and Edward now live with Pinako and Winry.\n\nPinako is worried about their obsession with Alchemy, and that they don't give attention to their studies.\nSo to improve their mathematical solving ability, every day she gives a mathematical problem to solve. They can go out to practice Alchemy only after they have solved the problem.\nHelp them by solving the given problem, so that they can go early today for their Alchemy practice.    \nGiven an array A$A$ of N$N$ non-negative integers and two integers K$K$ and M$M$. Find the number of subsequences of array A$A$ of length K$K$ which satisfies the following property:\n\nSuppose the subsequence is S=S1S2…SK$S = S_1S_2 \\ldots S_K$, then for all i$i$ such that 1≤i≤K$1 \\leq i \\leq K$,\nSi%M=i%M S_i \\% M = i \\% M  \nshould hold true, where Si$S_i$ denotes the i$i$-th element of the subsequence, using 1-based indexing.\nAs the number of subsequences may be very large, output the answer modulo 1000000007$1000000007$.     \nPS: We also proposed the idea of making a look-alike clone through alchemy and keeping it in front of the study table. But it seems impossible to convince Edward to make a clone of his exact same height, and not taller than him. So solving the problem for him was a better choice.   \n\n-----Input:-----\n- The first line contains T$T$, the number of test cases. Then the test cases follow. \n- For every test case, the first line contains N$N$, K$K$ and M$M$.\n- For every test case, the second line contains N$N$ integers Ai$A_{i}$ ( 1≤i≤N$1 \\leq i \\leq N$).\n\n-----Output:-----\nFor every test case, output in a single line an integer denoting the number of valid subsequences modulo 109+7$10^9+7$\n\n-----Constraints-----\n- 1≤T≤100$1 \\leq T \\leq 100$ \n- 1≤N≤104$1 \\leq N \\leq 10^{4}$ \n- 1≤K≤N$1 \\leq K \\leq N$ \n- ⌈K100⌉≤M≤100×K$\\lceil \\frac{K}{100}\\rceil \\leq M \\leq  100\\times K$ \n- 0≤Ai≤109$0 \\leq A_{i} \\leq 10^{9}$ \n\n-----Sample Input:-----\n1\n12 4 3\n4 5 6 7 1 4 6 9 0 0 10 2\n\n-----Sample Output:-----\n8\n\n-----Explanation:-----\nThe subsequences of length 4$4$, satisfying the given criteria are [4,5,6,7]$[4, 5, 6, 7]$, [4,5,6,10]$[4, 5, 6, 10]$, [4,5,6,10]$[4, 5, 6, 10]$, [4,5,6,1]$[4, 5, 6, 1]$, [4,5,9,10]$[4, 5, 9, 10]$ ,[4,5,6,4]$[4, 5, 6, 4]$ , [4,5,0,10]$[4, 5, 0, 10]$ and [4,5,0,10]$[4, 5, 0, 10]$. This accounts for a total of 8$8$ valid subsequences.\nLet us take one subsequence and see why it satisfies the given property. Consider [4,5,9,10]$[4, 5, 9, 10]$. \n- S1%M=4%3=1=1%3=1%M$ S_1 \\% M = 4 \\% 3 = 1 = 1 \\% 3 = 1 \\% M $\n- S2%M=5%3=2=2%3=2%M$ S_2 \\% M = 5 \\% 3 = 2 = 2 \\% 3 = 2 \\% M $\n- S3%M=9%3=0=3%3=3%M$ S_3 \\% M = 9 \\% 3 = 0 = 3 \\% 3 = 3 \\% M $\n- S4%M=10%3=1=4%3=4%M$ S_4 \\% M = 10 \\% 3 = 1 = 4 \\% 3 = 4 \\% M $\nAll the valid i$i$ satisfy the condition, and hence this is a valid subsequence.", "input_output": [{"input": ["1", "12 4 3", "4 5 6 7 1 4 6 9 0 0 10 2"], "output": ["8"]}]}
{"id": 477, "question": "Given two positive integers n and k, the binary string  Sn is formed as follows:\n\nS1 = \"0\"\nSi = Si-1 + \"1\" + reverse(invert(Si-1)) for i > 1\n\nWhere + denotes the concatenation operation, reverse(x) returns the reversed string x, and invert(x) inverts all the bits in x (0 changes to 1 and 1 changes to 0).\nFor example, the first 4 strings in the above sequence are:\n\nS1 = \"0\"\nS2 = \"011\"\nS3 = \"0111001\"\nS4 = \"011100110110001\"\n\nReturn the kth bit in Sn. It is guaranteed that k is valid for the given n.\n \nExample 1:\nInput: n = 3, k = 1\nOutput: \"0\"\nExplanation: S3 is \"0111001\". The first bit is \"0\".\n\nExample 2:\nInput: n = 4, k = 11\nOutput: \"1\"\nExplanation: S4 is \"011100110110001\". The 11th bit is \"1\".\n\nExample 3:\nInput: n = 1, k = 1\nOutput: \"0\"\n\nExample 4:\nInput: n = 2, k = 3\nOutput: \"1\"\n\n \nConstraints:\n\n1 <= n <= 20\n1 <= k <= 2n - 1", "input_output": [{"input": [3, 1], "output": "0"}]}
{"id": 1440, "question": "You are given an array $A$ of $N$ positive and pairwise distinct integers. \nYou can permute the elements in any way you want. \nThe cost of an ordering $(A_1, A_2, \\ldots, A_N)$ is defined as $ (((A_1 \\bmod A_2) \\bmod A_3)......) \\bmod A_N$ where $X \\bmod Y$ means the remainder when $X$ is divided by $Y$. \nYou need to find the maximum cost which can be attained through any possible ordering of the elements.\n\n-----Input:-----\n- The first line contains $T$ denoting the number of test cases.\n- The first line of each testcase contains a single integer $N$. \n- The second line of each testcase contains $N$ space-separated integers, the elements of $A$. \n\n-----Output:-----\n- For each testcase, output the maximum possible cost in a new line. \n\n-----Constraints-----\n- $1 \\leq T \\leq 5*10^5$\n- $2 \\leq N \\leq 5*10^5$\n- $1 \\leq A_i  \\leq 10^9$\n- Sum of $N$ over all testcases is less than or equal to $10^6$\n- All elements in a single testcase are distinct.\n\n-----Subtasks-----\n- 100 points : Original constraints.\n\n-----Sample Input:-----\n1\n2\n7 12\n\n-----Sample Output:-----\n7\n\n-----Explanation:-----\nThe two possible ways to order the elements are [7, 12] and [12, 7]. In the first case, the cost is $7 \\bmod 12 = 7$ and in the second case the cost is $12 \\bmod 7 = 5$. Clearly the answer is 7.", "input_output": [{"input": ["1", "2", "7 12"], "output": ["7"]}]}
{"id": 42, "question": "You are given a binary string $s$ (recall that a string is binary if each character is either $0$ or $1$).\n\nLet $f(t)$ be the decimal representation of integer $t$ written in binary form (possibly with leading zeroes). For example $f(011) = 3, f(00101) = 5, f(00001) = 1, f(10) = 2, f(000) = 0$ and $f(000100) = 4$.\n\nThe substring $s_{l}, s_{l+1}, \\dots , s_{r}$ is good if $r - l + 1 = f(s_l \\dots s_r)$.\n\nFor example string $s = 1011$ has $5$ good substrings: $s_1 \\dots s_1 = 1$, $s_3 \\dots s_3 = 1$, $s_4 \\dots s_4 = 1$, $s_1 \\dots s_2 = 10$ and $s_2 \\dots s_4 = 011$. \n\nYour task is to calculate the number of good substrings of string $s$.\n\nYou have to answer $t$ independent queries.\n\n\n-----Input-----\n\nThe first line contains one integer $t$ ($1 \\le t \\le 1000$) — the number of queries.\n\nThe only line of each query contains string $s$ ($1 \\le |s| \\le 2 \\cdot 10^5$), consisting of only digits $0$ and $1$.\n\nIt is guaranteed that $\\sum\\limits_{i=1}^{t} |s_i| \\le 2 \\cdot 10^5$.\n\n\n-----Output-----\n\nFor each query print one integer — the number of good substrings of string $s$.\n\n\n-----Example-----\nInput\n4\n0110\n0101\n00001000\n0001000\n\nOutput\n4\n3\n4\n3", "input_output": [{"input": "4\n0110\n0101\n00001000\n0001000\n", "output": "4\n3\n4\n3\n"}]}
{"id": 291, "question": "Given an array of integers arr. Return the number of sub-arrays with odd sum.\nAs the answer may grow large, the answer must be computed modulo 10^9 + 7.\n \nExample 1:\nInput: arr = [1,3,5]\nOutput: 4\nExplanation: All sub-arrays are [[1],[1,3],[1,3,5],[3],[3,5],[5]]\nAll sub-arrays sum are [1,4,9,3,8,5].\nOdd sums are [1,9,3,5] so the answer is 4.\n\nExample 2:\nInput: arr = [2,4,6]\nOutput: 0\nExplanation: All sub-arrays are [[2],[2,4],[2,4,6],[4],[4,6],[6]]\nAll sub-arrays sum are [2,6,12,4,10,6].\nAll sub-arrays have even sum and the answer is 0.\n\nExample 3:\nInput: arr = [1,2,3,4,5,6,7]\nOutput: 16\n\nExample 4:\nInput: arr = [100,100,99,99]\nOutput: 4\n\nExample 5:\nInput: arr = [7]\nOutput: 1\n\n \nConstraints:\n\n1 <= arr.length <= 10^5\n1 <= arr[i] <= 100", "input_output": [{"input": [[1, 3, 5]], "output": 4}]}
{"id": 45, "question": "Jett is tired after destroying the town and she wants to have a rest. She likes high places, that's why for having a rest she wants to get high and she decided to craft staircases.\n\nA staircase is a squared figure that consists of square cells. Each staircase consists of an arbitrary number of stairs. If a staircase has $n$ stairs, then it is made of $n$ columns, the first column is $1$ cell high, the second column is $2$ cells high, $\\ldots$, the $n$-th column if $n$ cells high. The lowest cells of all stairs must be in the same row.\n\nA staircase with $n$ stairs is called nice, if it may be covered by $n$ disjoint squares made of cells. All squares should fully consist of cells of a staircase. This is how a nice covered staircase with $7$ stairs looks like: [Image] \n\nFind out the maximal number of different nice staircases, that can be built, using no more than $x$ cells, in total. No cell can be used more than once.\n\n\n-----Input-----\n\nThe first line contains a single integer $t$ $(1 \\le t \\le 1000)$  — the number of test cases.\n\nThe description of each test case contains a single integer $x$ $(1 \\le x \\le 10^{18})$  — the number of cells for building staircases.\n\n\n-----Output-----\n\nFor each test case output a single integer  — the number of different nice staircases, that can be built, using not more than $x$ cells, in total.\n\n\n-----Example-----\nInput\n4\n1\n8\n6\n1000000000000000000\n\nOutput\n1\n2\n1\n30\n\n\n\n-----Note-----\n\nIn the first test case, it is possible to build only one staircase, that consists of $1$ stair. It's nice. That's why the answer is $1$.\n\nIn the second test case, it is possible to build two different nice staircases: one consists of $1$ stair, and another consists of $3$ stairs. This will cost $7$ cells. In this case, there is one cell left, but it is not possible to use it for building any nice staircases, that have not been built yet. That's why the answer is $2$.\n\nIn the third test case, it is possible to build only one of two nice staircases: with $1$ stair or with $3$ stairs. In the first case, there will be $5$ cells left, that may be used only to build a staircase with $2$ stairs. This staircase is not nice, and Jett only builds nice staircases. That's why in this case the answer is $1$. If Jett builds a staircase with $3$ stairs, then there are no more cells left, so the answer is $1$ again.", "input_output": [{"input": "4\n1\n8\n6\n1000000000000000000\n", "output": "1\n2\n1\n30\n"}]}
{"id": 995, "question": "Mr. Krabs loves money. He enters a bank and sees that there are n rooms arranged in a row. The only rooms with doors are the two rooms on either corner. Initially, all the rooms are locked (including the corner ones). To enter a room, it must be unlocked with a key.\nMr. Krabs is able to steal k keys from the sleeping night guard. Each key can be used to unlock only one room. To reach one of the inner rooms, he has to unlock an adjacent room first.\nEg: If there are 5 rooms labelled: 1 2 3 4 5\nOnly Rooms 1 and 5 can be accessed initially. To unlock room 2, either room 1 or room 3 must be unlocked. Similarly to unlock Room 4, he must unlock room 5 or room 3 first.\nEach room has some money in it. The money present in room i is given by A[i]. Using the k keys, calculate what is the maximum possible amount of money obtainable.\n\n-----Input:-----\n- First line will contain n,  number of rooms.\n- Second line will contain space separated integers, denoting A[i], money present in each room.\n- Third line will contain an integer, k, the number of keys available.\n\n-----Output:-----\nMaximum money obtained.\n\n-----Constraints-----\n- 1 <= Number of Rooms <= 10^5\n- 1 <= A[i] <= 10^4\n- 1 <= k <= Number of Rooms\n\n-----Subtasks-----\n- 40 points : 1 <= Number of Rooms <= 100\n- 60 points : Number of Rooms > 100\n\n-----Sample Input:-----\n7\n1 2 3 4 5 6 1\n3\n\n-----Sample Output:-----\n12\n\n-----Explanation:-----\nFor the first step, Mr. Krabs can only unlock the room at the left corner or the right corner. If he unlocks the room in the right corner, he obtains 1 dollar. He can then go on to unlock the second last room and gain 6 dollars, for a total of 7 dollars. Finally he can unlock the third last room and get 5 dollars, for a total of 12 dollars. \nThis is the maximum amount of money he can get with only 3 keys.", "input_output": [{"input": ["7", "1 2 3 4 5 6 1", "3"], "output": ["12"]}]}
{"id": 734, "question": "Chef has $N$ markers. There is a cap on each marker. For each valid $i$, the $i$-th marker has colour $a_i$. Initially, for each valid $i$, the colour of the cap on the $i$-th marker is also $a_i$.\nChef wants to rearrange the caps in such a way that no marker has the same colour as its cap. (Obviously, each marker must have exactly one cap.) Can he do that? If he can, find one such way to rearrange the caps. If there are multiple solutions, you may find any one.\n\n-----Input-----\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first line of each test case contains a single integer $N$.\n- The second line contains $N$ space-separated integers $a_1, a_2, \\ldots, a_N$.\n\n-----Output-----\n- For each test case:\n- If Chef cannot successfully rearrange the caps, print a single line containing the string \"No\" (without quotes).\n- Otherwise, print two lines. The first line should contain the string \"Yes\" (without quotes). The second line should contain $N$ space-separated integers describing a valid rearrangement of caps. For each valid $i$, the $i$-th of these integers should denote the final colour of the cap on the $i$-th marker.\n\n-----Constraints-----\n- $1 \\le T \\le 10$\n- $1 \\le N \\le 10^5$\n- $1 \\le a_i \\le 10^9$ for each valid $i$\n\n-----Example Input-----\n2\n9\n1 1 1 2 2 2 3 3 3\n2\n1 1\n\n-----Example Output-----\nYes\n2 2 2 3 3 3 1 1 1\nNo", "input_output": [{"input": ["2", "9", "1 1 1 2 2 2 3 3 3", "2", "1 1"], "output": ["Yes", "2 2 2 3 3 3 1 1 1", "No"]}]}
{"id": 464, "question": "You have an array arr of length n where arr[i] = (2 * i) + 1 for all valid values of i (i.e. 0 <= i < n).\nIn one operation, you can select two indices x and y where 0 <= x, y < n and subtract 1 from arr[x] and add 1 to arr[y] (i.e. perform arr[x] -=1 and arr[y] += 1). The goal is to make all the elements of the array equal. It is guaranteed that all the elements of the array can be made equal using some operations.\nGiven an integer n, the length of the array. Return the minimum number of operations needed to make all the elements of arr equal.\n \nExample 1:\nInput: n = 3\nOutput: 2\nExplanation: arr = [1, 3, 5]\nFirst operation choose x = 2 and y = 0, this leads arr to be [2, 3, 4]\nIn the second operation choose x = 2 and y = 0 again, thus arr = [3, 3, 3].\n\nExample 2:\nInput: n = 6\nOutput: 9\n\n \nConstraints:\n\n1 <= n <= 10^4", "input_output": [{"input": [3], "output": 2}]}
{"id": 1033, "question": "Given the values at the leaf nodes of a complete binary tree. The total number of nodes in the binary tree, is also given. Sum of the values at both the children of a node is equal to the value of the node itself. You can add any value or subtract any value from a node. Print the minimum change(difference made) in the sum of values of all the nodes in the tree, such that all the leaf nodes have the same value.\n\nNote: If a value transfers from one node to another, then that is not a change, but if an extra is needed to be added or subtracted to the entire total value of the nodes, then that is a change.\n\nInput Description:\n\nInput will contain an integer N, the number of nodes in the tree on a newline, followed by N space separated integers representing the values at the leaf nodes of the tree.\n\nOutput Description:\n\nPrint the required value on a newline.\n\nConstraints:\n\n1<=N<=20000\n1<=Value at each node in the leaves<=1000\n\nExample 1:\nInput:\n\n1\n\n50\nOutput:\n\n0\n\nExplanation: Since there is only one node, it is a leaf node itself and no change needs to be made.\n\nExample 2:\nInput:\n\n3\n\n200 800\nOutput:\n\n0 \n\nExplanation: There are two leaf nodes, and they can be made to 500 500, since no change in the total was made so difference made is 0. \n\nExample 3:\nInput:\n\n30\n\n29 33 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17\nOutput:\n\n6\n\nOutput: A total change of 6 needs to be changed to the entire value of the nodes, to get the leaf nodes equal.", "input_output": [{"input": ["1:", "Input:", "1", "50"], "output": ["0"]}]}
{"id": 1410, "question": "Alice's school is planning to take some students from her class on a field trip. Alice is really excited about it. There are a total of S students in her class. But due to budget constraints, the school is planning to take only N students for the trip. These students will be picked randomly. And each student has equal chance of being picked.\nAlice's friend circle has M students including her. Though she is excited about the field trip, she will enjoy it only if there are atleast K of her friends with her on the trip. She is wondering what are the chances of that happening. She needs your help. Tell her the probability that she will enjoy given that she goes on the trip.\n\n-----Input:-----\nFirst line of input contains a single integer T, the number of test cases.\n\nEach test starts with a single line having 4 space separated integers, S, N, M and K.\n\n-----Output:-----\nFor each test case, output a line containing the required probability. The answer will be accepted if the relative error is not more than 10-6.\n\n-----Constraints:-----\n1 ≤ T ≤ 100\n1 ≤ S ≤ 1000\n1 ≤ N ≤ S\n1 ≤ M ≤ S\n0 ≤ K < M\n\n-----Example:-----Input:\n3\n10 10 5 3\n10 4 6 4\n3 2 2 1\n\nOutput:\n1.000000\n0.000000\n0.500000\n\n-----Explanation:-----Case #1:\nEvery student will be taken to the trip. So all her 4 friends will accompany her to the trip no matter what. \nCase #2:\nAlice wants 4 out of her 5 friends to come along with her which isn't possible because the school is willing to pick only 4 students for the trip.", "input_output": [{"input": ["3", "10 10 5 3", "10 4 6 4", "3 2 2 1"], "output": ["1.000000", "0.000000", "0.500000"]}]}
{"id": 1465, "question": "You are given a tree consisting of n nodes numbered from 1 to n. The weights of edges of the tree can be any binary integer satisfying following Q conditions.\n\n- \n\t\tEach condition is of form u, v, x where u, v are nodes of the tree and x is a binary number. \n\n\t\tFor satisfying this condition,  sum of the weight of all the edges present in the path from node u to v of the tree, should have even if x = 0, odd otherwise. \n\t\n\nNow, you have to find out number of ways of assigning 0/1 (binary) weights to the edges of the tree satisfying the above conditions.\nAs the answer could be quite large, print your answer modulo 109 + 7.\n\n-----Input-----\n- The first line of input contains a single integer T denoting number of test cases.\n- For each test case:\n\t\n- First line contains two space separated integers n, Q.\n- Each of the next n - 1 lines will contain two space separated integer  u, v denoting that there is an edge between vertex u and v in the tree.\n- Each of the next Q lines will contain three space separated integer  u, v, x denoting a condition as stated in the probelm.\n\n-----Output-----\n- For each test case, output a single integer corresponding to the answer of the problem.\n\n-----Constraints-----\n- 1 ≤ u, v ≤ n\n- 0 ≤ x ≤ 1\n\n-----Subtasks-----\nSubtask #1 : (10 points)\n- Sum of each of variables n and Q over all the test cases ≤ 20\n\nSubtask #2 : (20 points)\n- Sum of each of variables n and Q over all the test cases ≤ 100\n\nSubtask #3 : (30 points)\n- Sum of each of variables n and Q over all the test cases ≤ 5000\n\nSubtask #4 : (40 points)\n- Sum of each of variables n and Q over all the test cases ≤ 100000\n\n-----Example-----\nInput:\n3\n3 2\n1 2\n1 3\n1 2 0\n1 3 0\n3 0\n1 2\n2 3\n3 1\n1 2\n2 3\n1 2 1\n\nOutput:\n1\n4\n2\n\n-----Explanation-----\nIn the first example, \nYou can only set the weight of each edge equal to 0 for satisfying the given condition. So, there is exactly one way of doing this. Hence answer is 1.\n\nIn the second example, \nThere are two edges and there is no condition on the edges. So, you can assign them in 4 ways. \n\nIn the third example, \nYou have to assign the weight of edge between node 1 and 2 to 1. You can assign the remaining edge from 2 to 3 either 0 or 1. So, the answer is 2.", "input_output": [{"input": ["3", "3 2", "1 2", "1 3", "1 2 0", "1 3 0", "3 0", "1 2", "2 3", "3 1", "1 2", "2 3", "1 2 1"], "output": ["1", "4", "2"]}]}
{"id": 204, "question": "Suppose an array sorted in ascending order is rotated at some pivot unknown to you beforehand.\n\n(i.e., [0,1,2,4,5,6,7] might become [4,5,6,7,0,1,2]).\n\nYou are given a target value to search. If found in the array return its index, otherwise return -1.\n\nYou may assume no duplicate exists in the array.\n\nYour algorithm's runtime complexity must be in the order of O(log n).\n\nExample 1:\n\n\nInput: nums = [4,5,6,7,0,1,2], target = 0\nOutput: 4\n\n\nExample 2:\n\n\nInput: nums = [4,5,6,7,0,1,2], target = 3\nOutput: -1", "input_output": [{"input": [[4, 5, 6, 7, 0, 1, 2], 0], "output": 4}]}
{"id": 34, "question": "You have a large electronic screen which can display up to $998244353$ decimal digits. The digits are displayed in the same way as on different electronic alarm clocks: each place for a digit consists of $7$ segments which can be turned on and off to compose different digits. The following picture describes how you can display all $10$ decimal digits:\n\n[Image]\n\nAs you can see, different digits may require different number of segments to be turned on. For example, if you want to display $1$, you have to turn on $2$ segments of the screen, and if you want to display $8$, all $7$ segments of some place to display a digit should be turned on.\n\nYou want to display a really large integer on the screen. Unfortunately, the screen is bugged: no more than $n$ segments can be turned on simultaneously. So now you wonder what is the greatest integer that can be displayed by turning on no more than $n$ segments.\n\nYour program should be able to process $t$ different test cases.\n\n\n-----Input-----\n\nThe first line contains one integer $t$ ($1 \\le t \\le 100$) — the number of test cases in the input.\n\nThen the test cases follow, each of them is represented by a separate line containing one integer $n$ ($2 \\le n \\le 10^5$) — the maximum number of segments that can be turned on in the corresponding testcase.\n\nIt is guaranteed that the sum of $n$ over all test cases in the input does not exceed $10^5$.\n\n\n-----Output-----\n\nFor each test case, print the greatest integer that can be displayed by turning on no more than $n$ segments of the screen. Note that the answer may not fit in the standard $32$-bit or $64$-bit integral data type.\n\n\n-----Example-----\nInput\n2\n3\n4\n\nOutput\n7\n11", "input_output": [{"input": "2\n3\n4\n", "output": "7\n11\n"}]}
{"id": 943, "question": "Tejas has invited the Clash Team for a Dinner Party. He places V empty plates (numbered from 1 to V inclusive) in a straight line on a table. He has prepared 2 kinds of Delicious Dishes named dish A and dish B.\n\nHe has exactly V servings of Dish A and W servings of dish B. \n\nNow he wants to serve the dishes in such a way that if theith plate has serving of Dish A then (i-1)th plate should not have serving of Dish B. Assuming all the Dishes are identical find number of ways Tejas can serve the Clash Team.\n\n-----Input-----\n- The first line of the input contains an integer T denoting the number of test cases . The description of T testcases follow.\n\n- The first line of each test case contains two space seperated integers V W .\n\n-----Output-----\nFor each test case, output the number of ways Tejas can serve the Clash Team.\n\n\n-----Constraints-----\n\n- 1 ≤ T ≤ 100\n- 1 ≤ V ≤ 1000\n- 1 ≤ W ≤ 1000\n\n-----Example-----\nInput:\n\n1\n\n3 3 \n\nOutput:\n4\n\n\n\n-----Explanation-----\n\nIn the above example the 4 ways are:\n\nAAA\n\nAAB\n\nABB\n\nBBB", "input_output": [{"input": ["1", "3 3"], "output": ["4"]}]}
{"id": 1416, "question": "Han Solo and Chewbacca start a space journey to planet Naboo on the Millennium Falcon. During the journey they land at a mysterious planet with high gravity where they find n diamond stones scattered all around. All the stones are of same weight. Each stone has a value according to its purity which can be detected by a special device. They choose to divide the stones fairly among themselves in two halves so that they carry almost equal weights such that the difference between the value of two halves is as small as possible. If n is even, then sizes of two halves must be strictly n/2 and if n is odd, then size of one half must be (n-1)/2 and size of the other half must be (n+1)/2. Given the value of stones, help them to divide the stones among themselves.\n\n-----Input-----\nFirst line consists of an integer n which denotes the number of stones.Second line consists of n space separated integers denoting the value of the stones.\n\n-----Output-----\nFirst line consists of the values of the stones assigned to Han Solo.Second line consists of the values of the stones assigned to Chewbacca.Assume that the set containing the first value in the input is always assigned to Han Solo.Also the values in the output sets must follow the same ordering as the input.\n\n-----Constraints-----\nThe number of stones can range from 2 to 99.The values of the stones vary from 1 to 10^4.\n\n-----Example-----\nInput:\n7\n1 2 3 4 5 6 7\n\nOutput:\n1 2 4 7\n3 5 6\n\n-----Explanation-----\nThese 7 values must be separated into 2 sets of sizes 3 and 4.In this case, it is possible to form two sets (1,2,4,7) & (3,5,6) of equal size.The set containing the first value (i.e.) 1 must be assigned to Han Solo and the elements of the output sets have the same order as the input.", "input_output": [{"input": ["7", "1 2 3 4 5 6 7"], "output": ["1 2 4 7", "3 5 6"]}]}
{"id": 916, "question": "Chef was bored staying at home in the lockdown. He wanted to go out for a change. Chef and Chefu are fond of eating Cakes,so they decided to go the Cake shop where cakes of all possible price are available .\nThey decided to purchase cakes of equal price and each of them will pay for their cakes. Chef only has coins of denomination $N$ whereas Chefu has that of denomination $M$.\nSo they want your help to find out the minimum amount to be spent in order to purchase the cakes.\n\n-----Input:-----\n- First line will contain $T$, number of testcases. Then the testcases follow. \n- Each testcase contains of a single line of input, two integers $N, M$. \n\n-----Output:-----\nFor each testcase, output in a single line answer the minimum amount to be spent in order to purchase the cake.\n\n-----Constraints-----\n- $1 \\leq T \\leq 1000$\n- $2 \\leq N,M \\leq 10^7$\n\n-----Sample Input:-----\n1\n2 3\n\n-----Sample Output:-----\n6", "input_output": [{"input": ["1", "2 3"], "output": ["6"]}]}
{"id": 1069, "question": "Shivam is the youngest programmer in the world, he is just 12 years old. Shivam is learning programming and today he is writing his first program. \n\nProgram is very simple, Given two integers A and B, write a program to add these two numbers.\n\n-----Input-----\n\nThe first line contains an integer T, the total number of test cases. Then follow T lines, each line contains two Integers A and B. \n\n-----Output-----\nFor each test case, add A and B and display it in a new line.\n\n-----Constraints-----\n- 1 ≤ T ≤ 1000\n- 0 ≤ A,B ≤ 10000\n\n-----Example-----\nInput\n3 \n1 2\n100 200\n10 40\n\nOutput\n3\n300\n50", "input_output": [{"input": ["3", "1 2", "100 200", "10 40"], "output": ["3", "300", "50"]}]}
{"id": 1029, "question": "After a long and successful day of preparing food for the banquet, it is time to clean up. There is a list of n jobs to do before the kitchen can be closed for the night. These jobs are indexed from 1 to n.\n\nMost of the cooks have already left and only the Chef and his assistant are left to clean up. Thankfully, some of the cooks took care of some of the jobs before they left so only a subset of the n jobs remain. The Chef and his assistant divide up the remaining jobs in the following manner. The Chef takes the unfinished job with least index, the assistant takes the unfinished job with the second least index, the Chef takes the unfinished job with the third least index, etc. That is, if the unfinished jobs were listed in increasing order of their index then the Chef would take every other one starting with the first job in the list and the assistant would take every other one starting with the second job on in the list.\n\nThe cooks logged which jobs they finished before they left. Unfortunately, these jobs were not recorded in any particular order. Given an unsorted list\nof finished jobs, you are to determine which jobs the Chef must complete and which jobs his assitant must complete before closing the kitchen for the \nevening.\n\n-----Input-----\n\nThe first line contains a single integer T ≤ 50 indicating the number of test cases to follow. Each test case consists of two lines. The first line contains two numbers n,m satisfying 0 ≤ m ≤ n ≤ 1000. Here, n is the total number of jobs that must be completed before closing and m is the number of jobs that have already been completed. The second line contains a list of m distinct integers between 1 and n. These are the indices of the jobs that have already been completed. Consecutive integers are separated by a single space.\n\n-----Output-----\n\nThe output for each test case consists of two lines. The first line is a list of the indices of the jobs assigned to the Chef. The second line is a list of the indices of the jobs assigned to his assistant. Both lists must appear in increasing order of indices and consecutive integers should be separated by a single space. If either the Chef or the assistant is not assigned any jobs, then their corresponding line should be blank.\n\n-----Example-----\nInput:\n3\n6 3\n2 4 1\n3 2\n3 2\n8 2\n3 8\n\nOutput:\n3 6\n5\n1\n\n1 4 6\n2 5 7", "input_output": [{"input": ["3", "6 3", "2 4 1", "3 2", "3 2", "8 2", "3 8"], "output": ["3 6", "5", "1", "1 4 6", "2 5 7"]}]}
{"id": 1566, "question": "A matrix B (consisting of integers) of dimension N × N is said to be good if there exists an array A (consisting of integers) such that B[i][j]  = |A[i] - A[j]|, where |x| denotes absolute value of integer x.\nYou are given a partially filled matrix B of dimension N × N. Q of the entries of this matrix are filled by either 0 or 1. You have to identify whether it is possible to fill the remaining entries of matrix B (the entries can be filled by any integer, not necessarily by 0 or 1) such that the resulting fully filled matrix B is good.\n\n-----Input-----\nThe first line of the input contains an integer T denoting the number of test cases. \nThe first line of each test case contains two space separated integers N, Q.\nEach of the next Q lines contain three space separated integers i, j, val, which means that B[i][j] is filled with value val.\n\n-----Output-----\nFor each test case, output \"yes\" or \"no\" (without quotes) in a single line corresponding to the answer of the problem.\n\n-----Constraints-----\n- 1 ≤ T ≤ 106\n- 2 ≤ N ≤ 105\n- 1 ≤ Q ≤ 106\n- 1 ≤ i, j ≤ N\n- 0 ≤ val ≤ 1\n- Sum of each of N, Q over all test cases doesn't exceed 106\n\n-----Subtasks-----\n- Subtask #1 (40 points) 2 ≤ N ≤ 103, 1 ≤ Q ≤ 103, Sum of each of N, Q over all test cases doesn't exceed 104\n- Subtask #2 (60 points) Original Constraints\n\n-----Example-----\nInput\n4\n2 2\n1 1 0\n1 2 1\n2 3\n1 1 0\n1 2 1\n2 1 0\n3 2\n2 2 0\n2 3 1\n3 3\n1 2 1\n2 3 1\n1 3 1\n\nOutput\nyes\nno\nyes\nno\n\n-----Explanation-----\nExample 1. You can fill the entries of matrix B as follows. \n\n0 1\n1 0\nThis matrix corresponds to the array A = [1, 2].\n\nExample 2. It is impossible to fill the remaining entries of matrix B such that the resulting matrix is good, as B[1][2] = 1 and B[2][1] = 0, which is impossible.", "input_output": [{"input": ["4", "2 2", "1 1 0", "1 2 1", "2 3", "1 1 0", "1 2 1", "2 1 0", "3 2", "2 2 0", "2 3 1", "3 3", "1 2 1", "2 3 1", "1 3 1"], "output": ["yes", "no", "yes", "no"]}]}
{"id": 1063, "question": "Write a program to find the remainder when an integer A is divided by an integer B.\n\n-----Input-----\n\nThe first line contains an integer T, the total number of test cases. Then T lines follow, each line contains two Integers A and B. \n\n-----Output-----\nFor each test case, find the remainder when A is divided by  B, and display it in a new line.\n\n-----Constraints-----\n- 1 ≤ T ≤ 1000\n- 1 ≤ A,B ≤ 10000\n\n-----Example-----\nInput\n3 \n1 2\n100 200\n40 15\n\nOutput\n1\n100\n10", "input_output": [{"input": ["3", "1 2", "100 200", "40 15"], "output": ["1", "100", "10"]}]}
{"id": 1082, "question": "$Jaggu$ monkey a friend of $Choota$ $Bheem$ a great warrior of $Dholakpur$. He gets everything he wants. Being a friend of $Choota$ $Bheem$ he never has to struggle for anything, because of this he is in a great debt of $Choota$ $Bheem$, he really wants to pay his debt off.\nFinally the time has come to pay his debt off, $Jaggu$ is on a magical tree. He wants to collect apples from different branches but he is in a hurry. $Botakpur$ has attacked on $Dholakpur$ and $Bheem$ is severely injured, as been instructed by the village witch, $Bheem$ can only be saved by the apples of the magical tree. Each apple is placed in Tree Node structure and each apple has some sweetness. Now there's a problem as $Jaggu$ is also injured so he can only slide downwards and alse is collecting apples in his hand so he can't climb. You would be given $Q$ queries. Queries are of 2 type :-\n- \nEnding Node Node of $Jaggu$ is given. $format$ - type of query node -(1 2)\n- \nSweetness of Apple on a given node is changed. $format$ - type of query node new sweetness(2 3 10)\n$Note$: $Jaggu$ is always on the top of tree initially in each query.The sweetness is always positive.\nHelp $Jaggu$ in saving $Bheem$\n\n-----Input:-----\n- First line contains $N$ - (number of nodes).  \n- Next line contains $N$ integers with space giving sweetness of apple on Nodes $(1 to N)$\n- Next $N-1$ lines contain  $N1$ $N2$ connected nodes.\n- Next line contains single integer $Q$ Number of queries\n\n-----Output:-----\n- For each query of type 1, print total sweetness of apples. \n\n-----Constraints-----\n- $1 \\leq N \\leq 10^4$\n- $2 \\leq Q \\leq 10^4$\n\n-----Sample Input:-----\n10\n10 12 6 8 1 19 0 5 13 17\n1 2\n1 3\n1 4\n3 10\n4 8\n8 9\n4 5\n5 7\n5 6\n3\n1 1\n2 3 20\n1 8\n\n-----Sample Output:-----\n10\n23\n\n-----EXPLANATION:-----\nThis sweetness array is :\n$[10,2,6,8,1,19,0,5,13,17]$\nThe tree is:\n1   \n\n/  |   \\      \n\n2    3     4     \n\n/    /    \\      \n\n10     8        5   \n\n/        /    \\     \n\n9         7        6", "input_output": [{"input": ["10", "10 12 6 8 1 19 0 5 13 17", "1 2", "1 3", "1 4", "3 10", "4 8", "8 9", "4 5", "5 7", "5 6", "3", "1 1", "2 3 20", "1 8"], "output": ["10", "23"]}]}
{"id": 1320, "question": "Chef has many friends, but his best friend is Hemant. They both love to watch anime.\nIn fact, their weekends are meant for that only. Also, Hemant is highly into games, of which Chef is unaware. Hemant once gave a game to Chef and asked him to determine the winner of the game. Since the Chef is busy, and you are also his friend, he asked you to help him.\nThe Game is played between two players, $A$ and $B$. There are $N$ marbles. $A$ and $B$ plays alternately, and $A$ goes first. Each player can choose $1$ marble or $even$ number of marbles in his turn. The player who is not able to choose any marbles loses the game.\n\n-----Input:-----\n- The first line consists of a single integer $T$ denoting the number of test cases.\n- The Second line contains an integers $N$, denoting the number of marbles.\n\n-----Output:-----\nFor each test case, print the name of the player who loses the game.\n\n-----Constraints-----\n- $1 \\leq T \\leq 10^5$\n- $1 \\leq N \\leq 10^9$\n\n-----Sample Input:-----\n3\n1 \n3\n7 \n\n-----Sample Output:-----\nB\nA\nB", "input_output": [{"input": ["3", "1", "3", "7"], "output": ["B", "A", "B"]}]}
{"id": 298, "question": "Given two non-negative integers num1 and num2 represented as strings, return the product of num1 and num2, also represented as a string.\n\nExample 1:\n\n\nInput: num1 = \"2\", num2 = \"3\"\nOutput: \"6\"\n\nExample 2:\n\n\nInput: num1 = \"123\", num2 = \"456\"\nOutput: \"56088\"\n\n\nNote:\n\n\n       The length of both num1 and num2 is < 110.\n       Both num1 and num2 contain only digits 0-9.\n       Both num1 and num2 do not contain any leading zero, except the number 0 itself.\n       You must not use any built-in BigInteger library or convert the inputs to integer directly.", "input_output": [{"input": ["\"2\"", "\"3\""], "output": "600"}]}
{"id": 401, "question": "Given an array nums of integers, we need to find the maximum possible sum of elements of the array such that it is divisible by three.\n\n\n \nExample 1:\nInput: nums = [3,6,5,1,8]\nOutput: 18\nExplanation: Pick numbers 3, 6, 1 and 8 their sum is 18 (maximum sum divisible by 3).\nExample 2:\nInput: nums = [4]\nOutput: 0\nExplanation: Since 4 is not divisible by 3, do not pick any number.\n\nExample 3:\nInput: nums = [1,2,3,4,4]\nOutput: 12\nExplanation: Pick numbers 1, 3, 4 and 4 their sum is 12 (maximum sum divisible by 3).\n\n \nConstraints:\n\n1 <= nums.length <= 4 * 10^4\n1 <= nums[i] <= 10^4", "input_output": [{"input": [[3, 6, 5, 1, 8]], "output": 18}]}
{"id": 1092, "question": "The faculty of application management and consulting services (FAMCS) of the Berland State University (BSU) has always been popular among Berland's enrollees. This year, N students attended the entrance exams, but no more than K will enter the university. In order to decide who are these students, there are series of entrance exams. All the students with score strictly greater than at least (N-K) students' total score gets enrolled.\nIn total there are E entrance exams, in each of them one can score between 0 and M points, inclusively. The first E-1 exams had already been conducted, and now it's time for the last tribulation.\nSergey is the student who wants very hard to enter the university, so he had collected the information about the first E-1 from all N-1 enrollees (i.e., everyone except him). Of course, he knows his own scores as well.\nIn order to estimate his chances to enter the University after the last exam, Sergey went to a fortune teller. From the visit, he learnt about scores that everyone except him will get at the last exam. Now he wants to calculate the minimum score he needs to score in order to enter to the university. But now he's still very busy with minimizing the amount of change he gets in the shops, so he asks you to help him.\n\n-----Input-----\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\nThe first line of each test case contains four space separated integers N, K, E, M denoting the number of students, the maximal number of students who'll get enrolled, the total number of entrance exams and maximal number of points for a single exam, respectively.\nThe following N-1 lines will contain E integers each, where the first E-1 integers correspond to the scores of the exams conducted. The last integer corresponds to the score at the last exam, that was predicted by the fortune-teller.\nThe last line contains E-1 integers denoting Sergey's score for the first E-1 exams.\n\n-----Output-----\n\nFor each test case, output a single line containing the minimum score Sergey should get in the last exam in order to be enrolled. If Sergey doesn't have a chance to be enrolled, output \"Impossible\" (without quotes).\n\n-----Constraints-----\n\n- 1 ≤ T ≤ 5\n- 1 ≤ K < N ≤ 104\n- 1 ≤ M ≤ 109\n- 1 ≤ E ≤ 4\n\n-----Example-----\nInput:1\n4 2 3 10\n7 7 7\n4 6 10\n7 10 9\n9 9\n\nOutput:4\n\n-----Explanation-----\nExample case 1. If Sergey gets 4 points at the last exam, his score will be equal to 9+9+4=22. This will be the second score among all the enrollees - the first one will get 21, the second one will get 20 and the third will have the total of 26. Thus, Sergey will enter the university.", "input_output": [{"input": ["1", "4 2 3 10", "7 7 7", "4 6 10", "7 10 9", "9 9"], "output": ["4"]}]}
{"id": 1254, "question": "Chef wants to organize a contest. Predicting difficulty levels of the problems can be a daunting task. Chef wants his contests to be balanced in terms of difficulty levels of the problems.\nAssume a contest had total P participants. A problem that was solved by at least half of the participants (i.e. P / 2 (integer division)) is said to be cakewalk difficulty. A problem solved by at max P / 10 (integer division) participants is categorized to be a hard difficulty.\nChef wants the contest to be balanced. According to him, a balanced contest must have exactly 1 cakewalk and exactly 2 hard problems. You are given the description of N problems and the number of participants solving those problems. Can you tell whether the contest was balanced or not?\n\n-----Input-----\nThe first line of the input contains an integer T denoting the number of test cases.\nThe first line of each test case contains two space separated integers, N, P denoting the number of problems, number of participants respectively.\nThe second line contains N space separated integers, i-th of which denotes number of participants solving the i-th problem.\n\n-----Output-----\nFor each test case, output \"yes\" or \"no\" (without quotes) denoting whether the contest is balanced or not.\n\n-----Constraints-----\n- 1 ≤ T, N ≤ 500 \n- 1 ≤ P ≤ 108 \n- 1 ≤ Number of participants solving a problem ≤ P\n\n-----Subtasks-----\n- Subtask #1 (40 points): P is a multiple of 10\n- Subtask #2 (60 points): Original constraints\n\n-----Example-----\nInput\n6\n3 100\n10 1 100\n3 100\n11 1 100\n3 100\n10 1 10\n3 100\n10 1 50\n4 100\n50 50 50 50\n4 100\n1 1 1 1\n\nOutput\nyes\nno\nno\nyes\nno\nno\n\n-----Explanation-----\nExample case 1.: The problems are of hard, hard and cakewalk difficulty. There is 1 cakewalk and 2 hard problems, so the contest is balanced.\nExample case 2.: The second problem is hard and the third is cakewalk. There is 1 cakewalk and 1 hard problem, so the contest is not balanced.\nExample case 3.: All the three problems are hard. So the contest is not balanced.\nExample case 4.: The problems are of hard, hard, cakewalk difficulty. The contest is balanced.\nExample case 5.: All the problems are cakewalk. The contest is not balanced.\nExample case 6.: All the problems are hard. The contest is not balanced.", "input_output": [{"input": ["6", "3 100", "10 1 100", "3 100", "11 1 100", "3 100", "10 1 10", "3 100", "10 1 50", "4 100", "50 50 50 50", "4 100", "1 1 1 1"], "output": ["yes", "no", "no", "yes", "no", "no"]}]}
{"id": 1592, "question": "Chef is in need of money, so he decided to play a game with Ramsay. In this game, there are $N$ rows of coins (numbered $1$ through $N$). For each valid $i$, the $i$-th row contains $C_i$ coins with values $A_{i, 1}, A_{i, 2}, \\ldots, A_{i, C_i}$.\nChef and Ramsay alternate turns; Chef plays first. In each turns, the current player can choose one row that still contains coins and take one of the coins remaining in this row. Chef may only take the the first (leftmost) remaining coin in the chosen row, while Ramsay may only take the last (rightmost) remaining coin in the chosen row. The game ends when there are no coins left.\nEach player wants to maximise the sum of values of the coins he took. Assuming that both Chef and Ramsay play optimally, what is the maximum amount of money (sum of values of coins) Chef can earn through this game?\n\n-----Input-----\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first line of each test case contains a single integer $N$.\n- $N$ lines follow. For each valid $i$, the $i$-th of these lines contains an integer $C_i$, followed by a space and $C_i$ space-separated integers $A_{i, 1}, A_{i, 2}, \\ldots, A_{i, C_i}$.\n\n-----Output-----\nFor each test case, print a single line containing one integer ― the maximum amount of money Chef can earn.\n\n-----Constraints-----\n- $1 \\le T \\le 10$\n- $1 \\le N \\le 10^4$\n- $1 \\le C_i \\le 10$ for each valid $i$\n- $1 \\le A_{i, j} \\le 10^5$ for each valid $i$ and $j$\n\n-----Subtasks-----\nSubtask #1 (20 points): $N = 1$\nSubtask #2 (80 points): original constraints\n\n-----Example Input-----\n1\n2\n4 5 2 3 4\n2 1 6\n\n-----Example Output-----\n8\n\n-----Explanation-----\nExample case 1: One optimal sequence of moves is: Chef takes the coin with value $5$, Ramsay takes $4$, Chef takes $2$, Ramsay takes $3$, Chef takes $1$ and Ramsay takes $6$. At the end, Chef has $5+2+1 = 8$ units of money.", "input_output": [{"input": ["1", "2", "4 5 2 3 4", "2 1 6"], "output": ["8"]}]}
{"id": 1220, "question": "Lets wish Horsbug98 on his birthday and jump right into the question.\nIn Chefland, $6$ new mobile brands have appeared each providing a range of smartphones. For simplicity let the brands be represented by numbers $1$ to $6$. All phones are sold at the superstore. \nThere are total $N$ smartphones. Let $P_i$ & $B_i$ be the price and the brand of the $i^{th}$ smartphone. The superstore knows all the price and brand details beforehand. \nEach customer has a preference for brands. The preference is a subset of the brands available (i.e $1$ to $6$). Also, the customer will buy the $K^{th}$ costliest phone among all the phones of his preference.\nYou will be asked $Q$ queries. Each query consists of the preference of the customer and $K$.\nFind the price the customer has to pay for his preference. If no such phone is available, print $-1$\nNote that for each query the total number of smartphones is always $N$ since, after each purchase, the phones are replaced instantly.\n\n-----Input:-----\n- First Line contains $N$ and $Q$\n- Second-line contains $N$ integers $P_1,P_2,...,P_N$ (Price)\n- Third line contains $N$ integers $B_1,B_2,...,B_N$ (Brand)\n- Each of the next Q lines contains a query, the query is describes below\n- First line of each quey contains $b$ and $K$ where $b$ is the size of the preference subset.\n- Second line of each query contains $b$ integers, describing the preference subset.\n\n-----Output:-----\nFor each query, print the price to be paid.\n\n-----Constraints-----\n- $1 \\leq N, Q, P_i \\leq 10^5$\n- $1 \\leq B_i, b \\leq 6$\n- $1 \\leq K \\leq N$\n\n-----Sample Input:-----\n4 2\n4 5 6 7 \n1 2 3 4 \n3 3\n1 2 3\n3 4\n4 5 6 \n\n-----Sample Output:-----\n4\n\n-1\n\n-----Explaination-----\nQuery 1: The preference subset is {1, 2, 3}, The prices of phones available of these brands are {4, 5, 6}. The third costliest phone is 4.\nQuery 2: The preference subset is {4, 5, 6}, The prices of phones available of these brands are {7}.\nFouth costliest phone is required, which is not available. Hence, answer is $-1$.", "input_output": [{"input": ["4 2", "4 5 6 7", "1 2 3 4", "3 3", "1 2 3", "3 4", "4 5 6"], "output": ["4", "-1"]}]}
{"id": 740, "question": "There is a field with plants — a grid with $N$ rows (numbered $1$ through $N$) and $M$ columns (numbered $1$ through $M$); out of its $NM$ cells, $K$ cells contain plants, while the rest contain weeds. Two cells are adjacent if they have a common side.\nYou want to build fences in the field in such a way that the following conditions hold for each cell that contains a plant:\n- it is possible to move from this cell to each adjacent cell containing a plant without crossing any fences\n- it is impossible to move from this cell to any cell containing weeds or to leave the grid without crossing any fences\nThe fences can only be built between cells or on the boundary of the grid, i.e. on the sides of cells. The total length of the built fences is the number of pairs of side-adjacent cells such that there is a fence built on their common side plus the number of sides of cells on the boundary of the grid which have fences built on them. Find the minimum required total length of fences that need to be built.\n\n-----Input-----\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first line of each test case contains three space-separated integers $N$, $M$ and $K$.\n- $K$ lines follow. Each of these lines contains two space-separated integers $r$ and $c$ denoting that the cell in row $r$ and column $c$ contains a plant.\n\n-----Output-----\nFor each test case, print a single line containing one integer — the minimum required length of fences.\n\n-----Constraints-----\n- $1 \\le T \\le 10$\n- $1 \\le N, M \\le 10^9$\n- $1 \\le K \\le 10^5$\n- $1 \\le r \\le N$\n- $1 \\le c \\le M$\n- the cells containing plants are pairwise distinct\n\n-----Subtasks-----\nSubtask #1 (30 points): $1 \\le N, M \\le 1,000$\nSubtask #2 (70 points): original constraints\n\n-----Example Input-----\n2\n4 4 9\n1 4\n2 1 \n2 2\n2 3\n3 1\n3 3\n4 1\n4 2\n4 3\n4 4 1\n1 1\n\n-----Example Output-----\n20\n4\n\n-----Explanation-----\nExample case 1: The field looks like this ('x' denotes a cell containing a plant, '.' denotes a cell containing weeds):\n...x\nxxx.\nx.x.\nxxx.\n\nAn optimal solution is to build fences around the topmost plant (with length $4$), around the remaining eight plants (with length $12$) and around the hole between them (with length $4$). The total length is $4+12+4 = 20$.", "input_output": [{"input": ["2", "4 4 9", "1 4", "2 1", "2 2", "2 3", "3 1", "3 3", "4 1", "4 2", "4 3", "4 4 1", "1 1"], "output": ["20", "4"]}]}
{"id": 1206, "question": "As you might remember, the collector of Siruseri had ordered\na complete revision of the Voters List. He knew that constructing\nthe list of voters is a difficult task, prone to errors. Some\nvoters may have been away on vacation, others may have moved\nduring the enrollment and so on. \nTo be as accurate as possible, he entrusted the task to three different \nofficials. Each of them was to independently record the list of voters and \nsend it to the collector. In Siruseri, every one has a ID number and\nthe list would only list the ID numbers of the voters and not their names.\nThe officials were expected to arrange the ID numbers in ascending order\nin their lists. \nOn receiving the lists, the Collector realised that there were\ndiscrepancies - the three lists were not identical.  He decided\nto go with the majority. That is, he decided to construct the\nfinal list including only those ID numbers that appeared in at\nleast 2 out of the 3 lists.  For example if the three lists\nwere\n23  30  42  57  90\n21  23  35  57  90  92\n21  23  30  57  90 \n\nthen the final list compiled by the collector would be:\n21  23  30  57  90\n\nThe ID numbers 35, 42 and 92 which appeared in only one list\neach do not figure in the final list.\nYour task is to help the collector by writing a program that\nproduces the final list from the three given lists.\nInput format\nThe first line of the input contains 3 integers\nN1, N2 and\nN3.  N1 is the number of\nvoters in the first list, N2 is the number of\nvoters in the second list and N3 is the number of\nvoters in the third list.  The next N1 lines\n(lines 2,...,N1+1) contain one positive integer\neach and describe the first list in ascending order.  The following\n\nN2 lines (lines\nN1+2,...,N1+N2+1)\ndescribe the second list in ascending order and the final\nN3 lines (lines\n\nN1+N2+2,...,N1+N2+N3+1)\ndescribe the third list in ascending order.\nOutput format\nThe first line of the output should contain a single integer\nM indicating the number voters in the final list. The next\nM lines (lines 2,...,M+1) should contain one\npositive integer each, describing the list of voters in the final\nlist, in ascending order.\nTest data\nYou may assume that 1 ≤\nN1,N2,N3\n≤ 50000.  You may also assume that in 50% of the inputs 1 ≤ N1,N2,N3 ≤ 2000.\n\nExample\nSample input:\n5 6 5\n23\n30\n42\n57\n90\n21 \n23 \n35 \n57 \n90 \n92 \n21 \n23 \n30 \n57 \n90 \n\nSample output:\n5\n21 \n23 \n30 \n57 \n90", "input_output": [{"input": ["5 6 5", "23", "30", "42", "57", "90", "21", "23", "35", "57", "90", "92", "21", "23", "30", "57", "90", "Sample output:", "5", "21", "23", "30", "57", "90"], "output": []}]}
{"id": 336, "question": "Given two equal-size strings s and t. In one step you can choose any character of t and replace it with another character.\nReturn the minimum number of steps to make t an anagram of s.\nAn Anagram of a string is a string that contains the same characters with a different (or the same) ordering.\n \nExample 1:\nInput: s = \"bab\", t = \"aba\"\nOutput: 1\nExplanation: Replace the first 'a' in t with b, t = \"bba\" which is anagram of s.\n\nExample 2:\nInput: s = \"leetcode\", t = \"practice\"\nOutput: 5\nExplanation: Replace 'p', 'r', 'a', 'i' and 'c' from t with proper characters to make t anagram of s.\n\nExample 3:\nInput: s = \"anagram\", t = \"mangaar\"\nOutput: 0\nExplanation: \"anagram\" and \"mangaar\" are anagrams. \n\nExample 4:\nInput: s = \"xxyyzz\", t = \"xxyyzz\"\nOutput: 0\n\nExample 5:\nInput: s = \"friend\", t = \"family\"\nOutput: 4\n\n \nConstraints:\n\n1 <= s.length <= 50000\ns.length == t.length\ns and t contain lower-case English letters only.", "input_output": [{"input": ["\"bab\"", "\"aba\""], "output": 1}]}
{"id": 1017, "question": "Chef recently started working at ABC corporation. Let's number weekdays (Monday through Friday) by integers $1$ through $5$. For each valid $i$, the number of hours Chef spent working at the office on weekday $i$ was $A_i$.\nUnfortunately, due to the COVID-19 pandemic, Chef started working from home and his productivity decreased by a considerable amount. As per Chef's analysis, $1$ hour of work done at the office is equivalent to $P$ hours of work done at home.\nNow, in order to complete his work properly, Chef has to spend more hours working from home, possibly at the cost of other things like sleep. However, he does not have to do the same work on each day as he would have in the office ― for each weekday, he can start the work for this day on an earlier day and/or complete it on a later day. The only requirement is that his work does not pile up indefinitely, i.e. he can complete his work for each week during the same week. One day has $24$ hours.\nIf Chef is unable to complete his work for a week during those five weekdays, then he has to work during the weekend too. Chef wishes to know whether he has to work on weekends or if he can complete his work by working only on weekdays. Help him answer that question. (It is possible that Chef would be unable to finish his work even if he worked all the time, but he does not want to know about that.)\n\n-----Input-----\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first and only line of each test case contains six space-separated integers $A_1$, $A_2$, $A_3$, $A_4$, $A_5$ and $P$.\n\n-----Output-----\nFor each test case, print a single line containing the string \"Yes\" if Chef has to work on weekends or \"No\" otherwise (without quotes).\n\n-----Constraints-----\n- $1 \\le T \\le 1,000$\n- $0 \\le A_i \\le 24$ for each valid $i$\n- $1 \\le P \\le 24$\n\n-----Subtasks-----\nSubtask #1 (100 points): original constraints\n\n-----Example Input-----\n2\n14 10 12 6 18 2\n10 10 10 10 10 3\n\n-----Example Output-----\nNo\nYes\n\n-----Explanation-----\nExample case 1: Here, $P=2$, so the number of hours Chef has to work from home to handle his workload for days $1$ through $5$ is $[28,20,24,12,36]$. If he works for full $24$ hours on each of the five weekdays, he finishes all the work, so he does not have to work on weekends.\nExample case 2: No matter what Chef does, he will have to work on weekends.", "input_output": [{"input": ["2", "14 10 12 6 18 2", "10 10 10 10 10 3"], "output": ["No", "Yes"]}]}
{"id": 709, "question": "$Gogi$, $Tapu$ and $Sonu$ are the elite members of $Tapu$ $Sena$. $Gogi$ is always stoned and asks absurd questions, But this time he asked a question which seems to be very serious and interesting. $Tapu$ wants to solve this question to impress $Sonu$. He  gave an array of length N to $Tapu$, $Tapu$ can perform the following operations exactly once:\n- Remove any subarray from the given array given the resulting array formed after the removal is non-empty.    \n- Reverse the whole array.\nRemember you can’t shuffle the elements of the array.\nTapu needs to find out the maximum possible GCD of all the numbers in the array after applying the given operations exactly once. Tapu is very weak at programming, he wants you to solve this problem so that he can impress $Sonu$.\n\n-----Input:-----\n- The first line contains $T$, the number of test cases.\n- For each test case\n-FIrst line contains $N$.\n- Last line contains $N$ numbers of the array. \n\n-----Output:-----\nA single integer in a new line, maximum possible GCD. \n\n-----Constraints-----\n- $1 \\leq T \\leq 10^2$\n- $1 \\leq N \\leq 10^4$\n- $1 \\leq a[i] \\leq 10^9$\n\nSummation of N for all testcases is less than $10^6$ \n\n-----Sample Input 1:-----\n1\n1\n2\n\n-----Sample Output 1:-----\n2", "input_output": [{"input": ["1", "1", "2"], "output": ["2"]}]}
{"id": 987, "question": "Back in 2015, Usain Bolt announced that he'll be retiring after the 2017 World Championship. Though his final season did not end gloriously, we all know that he is a true legend and we witnessed his peak during 2008 - 2013. \nPost retirement, Usain Bolt is still leading an adventurous life. He's exploring the unexplored parts of the globe. But sometimes he gets bored, and reads questions asked about him on Quora. One such question he read was, \"Who would win a race between Usain Bolt and a tiger if the race is on a straight line track and the tiger is $distancetoBolt$ meters behind Bolt? The finishing point is $finish$ meters away from Bolt's starting position. The tiger starts with an initial speed of $0$ $meter/second$, and will accelerate itself with $tigerAccelaration$ $m/s^2$. Bolt can run with a constant speed of $boltSpeed$ $m/s$ from start to finish. Given these values, find out who will win the race - Bolt or the tiger? \"\nNote that Bolt will win the race if and only if he touches the finishing line before the tiger touches it. If both of them finish together, the tiger is announced as the winner since Bolt was given an initial advantage. See the figure below for more clarity.\n\nSince Bolt was busy practicing in the tracks during his Physics school classes, he is asking for your help to solve the question. Can you please help him?\nHe just remembers two formulae from the class, and thinks that they will be useful to you:\n$Displacement (S) $ = $ut$ +$ (1/2)at^2$ where $u$ is the initial velocity , #$ $is the acceleration and $t$ is the time taken.\n$Velocity$ = $Displacement /Time$\n\n-----Input:-----\n- The first line will contain $T$, the number of testcases. Then the description of each test case follow. \n- Each test case contains 4 integers $finish, distancetoBolt, tigerAccelaration, boltSpeed$. \n\n-----Output:-----\nFor each testcase, output in a single line, the word \"Bolt\" or \"Tiger\" without quotes, depending on whether Bolt wins or the tiger wins.\n\n-----Constraints-----\n- $1 \\leq T \\leq 100000$\n- $1 \\leq finish\\leq 10^5$\n- $1 \\leq distancetoBolt\\leq 10^5$\n- $1 \\leq tigerAccelaration\\leq 10^5$\n- $1 \\leq boltSpeed\\leq 10^5$\n\n-----Sample Input:-----\n2\n10 100 10 10\n100 10 5 10\n\n-----Sample Output:-----\nBolt\nTiger", "input_output": [{"input": ["2", "10 100 10 10", "100 10 5 10"], "output": ["Bolt", "Tiger"]}]}
{"id": 1354, "question": "You have a tree consisting of n vertices. You want to color each vertex of the tree in one of the k colors such that for any pair of vertices having same color, all the vertices belonging to the path joining them should also have same color. In other words, for any two vertices u, v with same color, all the vertices in the path joining them should also have color same as that of the u (or same as v, as u and v have same color). \n\nFind out possible number of ways in which you can color the tree satisfying the above property. As the answer could be large, print your answer modulo 109 + 7.\n\n-----Input-----\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\nFor each test case, first line contains two space separated integers n, k denoting number of vertices in the tree and total number of colors, respectively\nEach of the next n - 1 lines contain two space separated integers ui, vi, denoting that there is an edge between vertices ui and vi in the tree.\n\n-----Output-----\nFor each test case, output a single line corresponding to number of ways of coloring the tree.\n\n-----Constraints-----\n- 1 ≤ T ≤ 50\n- 1 ≤ n, k ≤ 50\n- 1 ≤ ui, vi ≤ n\n- ui ≠ vi\n\n-----Example-----\nInput\n3\n3 2\n1 2\n2 3\n3 1\n1 2\n2 3\n4 3\n1 2\n2 3\n2 4\n\nOutput:\n6\n1\n39\n\n-----Explanation-----\nIn the first example, You can color the vertices in the following 6 ways - {1, 1, 1}, {2, 2, 2}, {1, 2, 2}, {1, 1, 2}, {2, 1, 1}, {2, 2, 1}. Note that you can't color the tree in {1, 2, 1} as the vertices in the path connecting vertex 1 and 3, (i.e. 1, 2, 3) don't have same color. You can see that the color of 2nd vertex is not same as that of 1st and 3rd.\nIn the second example, Only possible coloring you can do is to color all the vertices with color 1.", "input_output": [{"input": ["3", "3 2", "1 2", "2 3", "3 1", "1 2", "2 3", "4 3", "1 2", "2 3", "2 4"], "output": ["6", "1", "39"]}]}
{"id": 1512, "question": "Tuzik and Vanya are playing the following game.\nThey have an N × M board and a chip to indicate the current game position. The chip can be placed on any one cell of the game board, each of which is uniquely identified by an ordered pair of positive integers (r, c), where 1 ≤ r ≤ N is the row number and 1 ≤ c ≤ M is the column number.\nInitially, the chip is placed at the cell identified as (1, 1). For his move, a player can move it either 1, 2 or 3 cells up, or 1 or 2 cells to the right. The player who can not move the chip loses. In other words, a player suffers defeat if the chip is placed in the cell (N, M) at the start of his turn.\nTuzik starts the game. You have to determine who will win the game if both players play optimally.\n\n-----Input-----\nThe first line contains an integer T denoting the number of tests. Each of the following T lines contain two integers N and M.\n\n-----Output-----\nFor each test output \"Tuzik\" or \"Vanya\" on a separate line, indicating who will win the game.\n\n-----Constraints-----\n- 1 ≤ T ≤ 100\n- 1 ≤ N, M ≤ 106\n\n-----Example-----\nInput:\n2\n4 4\n2 2\n\nOutput:\nTuzik\nVanya\n\n\n-----Explanation-----Test case 1: On his first turn Tuzik moves chip 3 cells up to the cell (4, 1). On his turn Vanya can move chip only right to the cell (4, 2) or to the cell (4, 3) and after that Tuzik moves it to (4, 4) and finishes the game.\n\nTest case 2: On his first Turn Tuzik can move chip to the cell (2, 1) or (1, 2), but on his next turn Vanya moves it to (2, 2) and wins the game.", "input_output": [{"input": ["2", "4 4", "2 2"], "output": ["Tuzik", "Vanya"]}]}
{"id": 868, "question": "\"It does not matter how slowly you go as long as you do not stop.\" - Confucius\nYou are given an array $A_1, A_2, \\ldots, A_N$ and an integer $K$. For each subarray $S = [A_l, A_{l+1}, \\ldots, A_r]$ ($1 \\le l \\le r \\le N$):\n- Let's define an array $B$ as $S$ concatenated with itself $m$ times, where $m$ is the smallest integer such that $m(r-l+1) \\ge K$.\n- Next, let's sort $B$ and define $X = B_K$, i.e. as a $K$-th smallest element of $B$. Note that $|B| \\ge K$.\n- Then, let's define $F$ as the number of occurrences of $X$ in $S$.\n- The subarray $S$ is beautiful if $F$ occurs in $S$ at least once.\nFind the number of beautiful subarrays of $A$. Two subarrays $A_l, A_{l+1}, \\ldots, A_r$ and $A_p, A_{p+1}, \\ldots, A_q$ are different if $l \\neq p$ or $r \\neq q$.\n\n-----Input-----\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first line of each test case contains two space-separated integers $N$ and $K$. \n- The second line contains $N$ space-separated integers $A_1, A_2, \\ldots, A_N$.\n\n-----Output-----\nFor each test case, print a single line containing one integer - the number of beautiful subarrays.\n\n-----Constraints-----\n- $1 \\le T \\le 5$\n- $1 \\le N \\le 2,000$\n- $1 \\le K \\le 10^9$\n- $1 \\le A_i \\le 2000$ for each valid $i$\n\n-----Subtasks-----\nSubtask #1 (20 points): $1 \\le N \\le 200$\nSubtask #2 (80 points): original constraints\n\n-----Example Input-----\n1\n3 3\n1 2 3\n\n-----Example Output-----\n3\n\n-----Explanation-----\nExample case 1: There are six subarrays of $A$: $[1]$, $[2]$, $[3]$, $[1, 2]$, $[2, 3]$, $[1, 2, 3]$. The corresponding arrays $B$ are $[1, 1, 1]$, $[2, 2, 2]$, $[3, 3, 3]$, $[1, 2, 1, 2]$, $[2, 3, 2, 3]$, $[1, 2, 3]$.\nThree of the subarrays are beautiful: $[1]$, $[1, 2]$ and $[1, 2, 3]$. For these subarrays, $X$ is $1$, $2$ and $3$ respectively (for example, for $S = [1, 2]$, $B = [1, 2, 1, 2]$ is sorted to $[1, 1, 2, 2]$ and $X = 2$ is the $3$-rd element). Then, $F = 1$ for each of these subarrays, and each of these subarrays contains $1$.", "input_output": [{"input": ["1", "3 3", "1 2 3"], "output": ["3"]}]}
{"id": 1365, "question": "There exist certain strings, known as $Unique$ $Strings$. They possess a unique property: \n- The character 'c' gets converted to \"ff\" and the character 'k' gets converted to \"gg\". Any letter besides 'c' and 'k' does not get converted to any other character.\nYour job is to count the number of strings that could possibly be represented by a given unique string. Since the value could be very large, output the remainder when divided by $10^9+7$.\nNote that if the given string is not a unique string, i.e. it contains either 'c' or 'k', output $0$.\n\n-----Input:-----\n- The first line of input contains a string, $s$.\n\n-----Output:-----\n- Output in a single line the possible number of strings modulo $10^9+7$.\n\n-----Constraints-----\n- $1 \\leq |s| \\leq 10^5$\nwhere |s| denotes length of string.\n\n-----Sample Input 1:-----\nthing\n\n-----Sample Input 2:-----\nggdffn\n\n-----Sample Input 3:-----\nfff\n\n-----Sample Input 4:-----\ncat\n\n-----Sample Output 1:-----\n1\n\n-----Sample Output 2:-----\n4\n\n-----Sample Output 3:-----\n3\n\n-----Sample Output 4:-----\n0\n\n-----EXPLANATION:-----\nThe possible strings that can be represented by the given string in each of the examples are as follows:\n$1)$ 'thing'\n$2)$ 'ggdffn','kdffn','ggdcn','kdcn'\n$3)$ 'fff','cf','fc'\n$4)$ Since the string 'cat' contains 'c', it is certain that this string is not a unique string. Hence, the output is $0$.", "input_output": [{"input": ["thing", "Sample Input 2:", "ggdffn", "Sample Input 3:", "fff", "Sample Input 4:", "cat"], "output": ["1", "Sample Output 2:", "4", "Sample Output 3:", "3", "Sample Output 4:", "0"]}]}
{"id": 763, "question": "You are given two binary strings $S$ and $P$, each with length $N$. A binary string contains only characters '0' and '1'. For each valid $i$, let's denote the $i$-th character of $S$ by $S_i$.\nYou have to convert the string $S$ into $P$ using zero or more operations. In one operation, you should choose two indices $i$ and $j$ ($1 \\leq i < j \\leq N$) such that $S_i$ is '1' and $S_j$ is '0', and swap $S_i$ with $S_j$.\nDetermine if it is possible to convert $S$ into $P$ by performing some operations.\n\n-----Input-----\n- The first line of the input contains a single integer $T$ denoting the number of test cases. The description of $T$ test cases follows.\n- The first line of each test case contains a single integer $N$.\n- The second line contains a single string $S$.\n- The third line contains a single string $P$.\n\n-----Output-----\nFor each test case, print a single line containing the string \"Yes\" if it is possible to convert $S$ into $P$ or \"No\" otherwise (without quotes).\n\n-----Constraints-----\n- $1 \\leq T \\leq 10^5$\n- $1 \\leq N \\leq 10^5$\n- $S$ and $P$ contain only characters '0' and '1'\n- the sum of $N$ over all test cases does not exceed $10^5$\n\n-----Subtasks-----\nSubtask #1 (20 points):\n- $N \\leq 14$\n- the sum of $N$ over all test cases does not exceed $100$\nSubtask #2 (30 points): the sum of $N$ over all test cases does not exceed $1,000$\nSubtask #3 (50 points): original constraints\n\n-----Example Input-----\n3\n2\n00\n00\n3\n101\n010\n4\n0110\n0011\n\n-----Example Output-----\nYes\nNo\nYes\n\n-----Explanation-----\nExample case 1: The strings are already equal.\nExample case 2: It can be showed that it is impossible to convert $S$ into $P$.\nExample case 3: You can swap $S_2$ with $S_4$. The strings will then be equal.", "input_output": [{"input": ["3", "2", "00", "00", "3", "101", "010", "4", "0110", "0011"], "output": ["Yes", "No", "Yes"]}]}
{"id": 1255, "question": "You are teaching students to generate strings consisting of unique lowercase latin characters (a-z). You give an example reference string $s$ to the students.\nYou notice that your students just copy paste the reference string instead of creating their own string. So, you tweak the requirements for strings submitted by the students.\nLet us define a function F(s, t) where s and t are strings as the number of characters that are same in both the strings. Note that the position doesn't matter. Here are a few examples of F(s, t):\nF(\"abc\", \"def\") = 0\nF(\"abc\", \"acb\") = 3\nF(\"back\", \"abcd\") = 3\nNow you ask your students to output a string t with lowercase unique characters of the same length as $s$, such that F(s, t) $\\leq k$ where you are also given the value of $k$. If there are multiple such strings, you ask them to output the lexicographically smallest possible string. If no such string is possible, output the string \"NOPE\" without quotes.\n\n-----Input:-----\n- The first line will contain $T$, the number of testcases. Then the testcases follow. \n- Each testcase contains of a single line of input, which contains a string $s$ and an integer $k$.\n\n-----Output:-----\nFor each testcase, output in a single line the lexicographically smallest string t such that F(s, t) <= k or \"NOPE\" without quotes if no such string exists.\n\n-----Constraints-----\n- $1 \\leq T \\leq 10000$\n- $1 \\leq $length of string s $(|s|) \\leq 26$\n- $s$ only consists of characters $a$ to $z$\n- There are no repeating characters in s\n- $0 \\leq k \\leq |s|$\n\n-----Sample Input:-----\n4\nhelowrd 0\nbackground 0\nabcdefghijklmnopqrstuvwxyz 0\nb 1\n\n-----Sample Output:-----\nabcfgij\nefhijlmpqs\nNOPE\na", "input_output": [{"input": ["4", "helowrd 0", "background 0", "abcdefghijklmnopqrstuvwxyz 0", "b 1"], "output": ["abcfgij", "efhijlmpqs", "NOPE", "a"]}]}
{"id": 1261, "question": "You have been appointed as the designer for your school's computer network.\nIn total, there are N computers in the class, and M computer-to-computer connections need to be made. Also, there are three mandatory conditions the design should fulfill.\nThe first requirement is that any computer in the network should be able to communicate with any other computer through the connections, possibly, through some other computers.\nNetwork attacks are possible, so the second requirement is that even if any one computer from the network gets disabled so that the rest of the computers are unable to communicate with it, the rest of the computers can still communicate with each other. In other words, the first requirement still holds for any subset of (N-1) computers.\nThe third requirement is that there shouldn't be any irrelevant connections in the network. We will call a connection irrelevant if and only if after its' removal, the above two requirements are still held.\nGiven N, M, please build a network with N computers and M connections, or state that it is impossible.\n\n-----Input-----\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\nThe first and only line of each test case contains a pair of space-separated integers N and M denoting the number of computers and the number of connections.\n\n-----Output-----\nOutput T blocks.\nIf it is impossible to construct a network with the given parameters for the corresponding test case, output just -1 -1. Otherwise, output M lines, each of which contains a space-separated pairs of integers denoting the IDs of the computers that should be connected. Note that multiple connections between any pair of computers and connections connecting a computer to itself are implicitly not allowed due to the third requirement.\n\n-----Constraints-----\n\n- 1 ≤ T ≤ 1000\n- 1 ≤ M ≤ N * (N - 1) / 2\n- 1 ≤ Sum of all N ≤ 1000\n- Subtask 1 (21 point): 1 ≤ N ≤ 4\n- Subtask 2 (79 points): 1 ≤ N ≤ 100\n\n-----Example-----\nInput:2\n10 1\n5 5\n\nOutput:-1 -1\n1 2\n2 3\n3 4\n4 5\n5 1\n\n-----Explanation-----\nExample case 1. There are not enough connections even to satisfy the first requirement.\nExample case 2. The obtained network satisfies all the requirements.", "input_output": [{"input": ["2", "10 1", "5 5"], "output": ["-1 -1", "1 2", "2 3", "3 4", "4 5", "5 1"]}]}
{"id": 810, "question": "Chef is frustrated in this lockown. So to overcome this he plans to travel various mountains.\nHe is very strange so he sets some conditions for $each$ Type 2 query(mentioned below) (i.e. $1$ $i$) : \n- Let Chef has travelled till $ith$ mountain from left to right.\n- He does not like to travel the mountain with the height ,of which he has travelled till now. More formally, \nLet the height of peak on which he is standing is $a_{i}$ then he can only go to the peak of height $a_{j}$ \nwhich is greater than $a_{i}$ and nearest to $ith$ mountain such that there should be no other peak of same height $a_{j}$ till $a_{i}$(height of $ith$ mountain) .\n\n-----Input format:-----\n- \nThe first line contains an integer $T$ denoting the number of test cases.\n- \nThe second line of  consist of a integer $N$ and $Q$ .\n- \nThe third line contains $N$ not necessarily distinct positive integers $a_{0},a_{1}, . . .,a_{n-1}$ denoting the height of \n$N$ mountains.\n- \nThen next $Q$ lines follows where each line consisting of $either$ of $2$ types of queries:\nType 1:  $0$ $A$ $B$ i.e. $a_{A} = B$ (where height of $Ath$ mountain will be updated to $B$) \nType 2:  $1$ $A$ i.e. you have to answer $a_k$ which is greater than $a_{A}$ and nearest to $Ath$ mountain such that there should be no other peak of same height $a_{k}$ till $a_{A}$(height of $Ath$ mountain) .\n\n-----Output format:-----\n- For every query of Type 2 there should be an integer $a_{k}$ on next  line for the updated array , If no such $a_{k}$ exists then $a_{k}$= $-1$ , as query of type 1 will have no output . \n\n-----Constraints:-----\n- $1\\leq T \\leq 10^2$\n- $1 \\leq N,Q \\leq 10^4$\n- $0\\leq a_{i} \\leq 10^6$\n- $0\\leq B \\leq 10^6$\n- $0\\leq A \\leq N-1$\n\n-----Subtasks-----\n- \n1 Point :   \n$1 \\leq T,N,Q \\leq 10^2$ \n$0\\leq B,a_{i} \\leq 10^2$\n- \n99 Points : Orginal   Constraints\n\n-----Example:-----\n\n-----Input:-----\n1\n10 5\n1 3 5 4 5 6 7 8  4 5\n1 7\n1 3\n1 1\n0 2 7\n1 3\n\n-----Output:-----\n-1\n6\n5\n5", "input_output": [{"input": ["1", "10 5", "1 3 5 4 5 6 7 8  4 5", "1 7", "1 3", "1 1", "0 2 7", "1 3"], "output": ["-1", "6", "5", "5"]}]}
{"id": 959, "question": "You are given an array with $N$ integers: $A[1], A[2], \\ldots, A[N]$ (where $N$ is even). You are allowed to permute the elements however you want. Say, after permuting the elements, you end up with the array $A'[1], A'[2], \\ldots, A'[N]$. Your goal is to maximize the following sum:\n|A′[1]−A′[2]| + |A′[3]−A′[4]| + ... + |A′[N−1]−A′[N]||A′[1]−A′[2]| + |A′[3]−A′[4]| + ... + |A′[N−1]−A′[N]|\n|A'[1] - A'[2]| \\ + \\ |A'[3] - A'[4]| \\ + \\ ... \\ + \\ |A'[N - 1] - A'[N]|\n\nHere, $|x|$ denotes the absolute value of $x$.\nYou have to print the maximum sum achievable.\n\n-----Input-----\n- The first line contains $T$, the number of test cases.\n- Each test case starts with an integer $N$ in the first line.\n- The second line of each test case contains $N$ space separated integers, denoting the values of array $A$.\n\n-----Output-----\nFor each test case, output the maximum sum achievable in a new line.\n\n-----Constraints-----\n- $1 \\le T \\le 10^5$\n- $1 \\le N \\le 10^5$\n- $N$ is even\n- $|A[i]| \\le 10^9$\n- Sum of $N$ over all test cases $\\le 2 * 10^5$\n\n-----Example Input 1-----\n1\n4\n1 -3 2 -3\n\n-----Example Output 1-----\n9\n\n-----Explanation 1-----\nThe original array is {$1, -3, 2, -3$}. Suppose you permute it and get the array {$2, 1, -3, -3$}. Then the corresponding sum would be $|2 - 1| \\ + \\ |-3 - (-3)| = 1 + 0 = 1$.\nBut suppose you permute it differently and get the array {$-3, 2, 1, -3$}. Then the corresponding sum would be $|-3 - 2| \\ + \\ |1 - (-3)| = 5 + 4 = 9$. You can check that you cannot do any better, and hence the answer is 9.", "input_output": [{"input": ["1", "4", "1 -3 2 -3"], "output": ["9"]}]}
{"id": 592, "question": "Teddy and Tracy like to play a game based on strings. The game is as follows. Initially, Tracy writes a long random string on a whiteboard. Then, each player starting with Teddy makes turn alternately. Each turn, the player must erase a contiguous substring that exists in the dictionary. The dictionary consists of N words.\nOf course, the player that can't erase any substring in his turn loses the game, and the other player is declared the winner.\nNote that after a substring R is erased, the remaining substring becomes separated, i.e. they cannot erase a word that occurs partially to the left of R and partially to the right of R.\n\nDetermine the winner of the game, assuming that both players play optimally.\n\n-----Input-----\nThe first line contains a single integer T, the number of test cases. T test cases follow. The first line of each testcase contains a string S, the string Tracy writes on the whiteboard. The next line contains a single integer N. N lines follow. The i-th line contains a single string wi, the i-th word in the dictionary.\n\n-----Output-----\nFor each test case, output a single line containing the name of the winner of the game.\n\n-----Example-----\nInput:\n3\ncodechef\n2\ncode\nchef\nfoo\n1\nbar\nmississippi\n4\nssissi\nmippi\nmi\nppi\n\nOutput:\nTracy\nTracy\nTeddy\n\n-----Constraints-----\n- 1 <= T <= 5\n- 1 <= N <= 30\n- 1 <= |S| <= 30\n- 1 <= |wi| <= 30\n- S and wi contain only characters 'a'-'z'", "input_output": [{"input": ["3", "codechef", "2", "code", "chef", "foo", "1", "bar", "mississippi", "4", "ssissi", "mippi", "mi", "ppi", "", ""], "output": ["Tracy", "Tracy", "Teddy"]}]}
